FilesystemAndDisk_Test/FS_Disk_SSD_MP400_4TB_NVMe_scripts/mp4004TB_fs_fio_test_write_ranseq/rand_write_block_128K_8_1_jobs.out
rand_write_test: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.28
Starting 1 process

rand_write_test: (groupid=0, jobs=1): err= 0: pid=397235: Sat May 11 15:57:31 2024
  write: IOPS=3225, BW=403MiB/s (423MB/s)(200GiB/507919msec); 0 zone resets
    slat (usec): min=8, max=2628, avg=28.88, stdev= 9.65
    clat (usec): min=7, max=36034, avg=278.74, stdev=323.93
     lat (usec): min=170, max=36060, avg=307.76, stdev=324.28
    clat percentiles (usec):
     |  1.00th=[  167],  5.00th=[  180], 10.00th=[  190], 20.00th=[  198],
     | 30.00th=[  204], 40.00th=[  210], 50.00th=[  217], 60.00th=[  229],
     | 70.00th=[  245], 80.00th=[  330], 90.00th=[  375], 95.00th=[  416],
     | 99.00th=[ 1418], 99.50th=[ 2769], 99.90th=[ 3982], 99.95th=[ 4686],
     | 99.99th=[ 6128]
   bw (  KiB/s): min=230400, max=651543, per=100.00%, avg=413321.65, stdev=88161.84, samples=1015
   iops        : min= 1800, max= 5090, avg=3228.98, stdev=688.76, samples=1015
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=72.00%
  lat (usec)   : 500=25.99%, 750=0.29%, 1000=0.21%
  lat (msec)   : 2=0.79%, 4=0.63%, 10=0.09%, 20=0.01%, 50=0.01%
  cpu          : usr=3.60%, sys=9.61%, ctx=1638663, majf=0, minf=217
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1638400,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=403MiB/s (423MB/s), 403MiB/s-403MiB/s (423MB/s-423MB/s), io=200GiB (215GB), run=507919-507919msec

Disk stats (read/write):
  nvme4n1: ios=0/1638362, merge=0/102, ticks=0/434808, in_queue=435891, util=100.00%

Test Time: 2024-05-11 15:57:31
Device Name: filetest.txt
Device Info: